#+TITLE: Emacs Config

* Configuración de Go

LSP, autocompletado...

#+BEGIN_SRC emacs-lisp
  (use-package go-mode
    :ensure t)
  (add-hook 'before-save-hook 'gofmt-before-save)
#+END_SRC

  #+RESULTS:
  | gofmt-before-save |
  
* Dap-mode

Debugger


#+BEGIN_SRC emacs-lisp
  (use-package with-venv
    :ensure t)

  (use-package dap-mode
    :after lsp-mode
    :commands dap-debug
    :hook ((python-mode . dap-ui-mode) (python-mode . dap-mode))
    :config
    (require 'dap-python)
    (setq dap-python-debugger 'debugpy)
    (defun dap-python--pyenv-executable-find (command)
      (with-venv (executable-find "python")))

    (add-hook 'dap-stopped-hook
              (lambda (arg) (call-interactively #'dap-hydra))))
  (dap-ui-mode 1)
(setq dap-print-io t)

#+END_SRC


Python uvicorn debug

#+BEGIN_SRC emacs-lisp
          ;; Configurar dap-mode para debuggear un servidor de Unicorn en Python
        ;;   (defun my-dap-python-unicorn ()
        ;;     "Configuración para depurar el servidor Unicorn en Python usando dap-mode."
        ;;     (interactive)
        ;;     (let ((project-root (or (lsp-workspace-root)  ;; Usa lsp para obtener el root
        ;;                             (projectile-project-root)))  ;; Usa projectile como respaldo
        ;;           (pythonpath (getenv "PYTHONPATH")))
        ;;       (dap-register-debug-template
        ;;        "Python Unicorn Server"
        ;;        (list :type "python"
        ;;              :args "uvicornn api.rest.server:app"  ;; Ajusta el comando de gunicorn con la ruta a tu app
        ;;              :program nil
        ;;              :request "launch"
        ;;              :name "Python Unicorn Debug"
        ;;              :cwd (expand-file-name "backend" project-root)  ;; Cambia el cwd a 'backend'
        ;;              :env `(("PYTHONPATH" . ,(or pythonpath (expand-file-name "backend" project-root))))  ;; Ajusta PYTHONPATH a backend
        ;;              :target-module (expand-file-name "backend/api/rest/server.py" project-root)  ;; Apunta al archivo correcto dentro de backend
        ;;              ;:console "integratedTerminal"
        ;; ))))
        ;;   (global-set-key (kbd "<f5>") 'my-dap-python-unicorn)  ;; Asignar F5 para iniciar la depuración

  (dap-register-debug-template "Uvicorn Process"
    (list :type "python"
          :args "-m uvicorn api.rest.server:app --reload"  ;; Ejecuta uvicorn desde backend
          :cwd "/home/samuel/Documentos/tws-workspace/tws-process/backend/"  ;; Directorio de trabajo
          :env '(("PYTHONPATH" . "/home/samuel/Documentos/tws-workspace/tws-process/backend/"))  ;; Incluye backend en PYTHONPATH
          :program nil
          :target-module (expand-file-name "/home/samuel/Documentos/tws-workspace/tws-process/backend/api/rest/server.py")
          :request "launch"
          :name "My App"))
#+END_SRC

#+RESULTS:
| Uvicorn Process                           | :type | python                                    | :args    | -m uvicorn api.rest.server:app --reload | :cwd       | /home/samuel/Documentos/tws-workspace/tws-process/backend/ | :env     | ((PYTHONPATH . /home/samuel/Documentos/tws-workspace/tws-process/backend/)) | :program | nil    | :target-module | /home/samuel/Documentos/tws-workspace/tws-process/backend/api/rest/server | :request | launch                        | :name | My App |
| Python :: Run pytest (at point)           | :type | python                                    | :args    |                                         | :program   | nil                                                        | :module  | pytest                                                                      | :request | launch | :name          | Python :: Run pytest (at point)                                           |          |                               |       |        |
| Python :: Run pytest (buffer)             | :type | python                                    | :args    |                                         | :cwd       | nil                                                        | :program | nil                                                                         | :module  | pytest | :request       | launch                                                                    | :name    | Python :: Run pytest (buffer) |       |        |
| Python :: Run file from project directory | :name | Python :: Run file from project directory | :type    | python                                  | :args      |                                                            | :cwd     | ${workspaceFolder}                                                          | :module  | nil    | :program       | nil                                                                       | :request | launch                        |       |        |
| Python :: Run file (buffer)               | :type | python                                    | :args    |                                         | :cwd       | nil                                                        | :module  | nil                                                                         | :program | nil    | :request       | launch                                                                    | :name    | Python :: Run file (buffer)   |       |        |
| Python :: Attach to running process       | :type | python                                    | :request | attach                                  | :processId | ${command:pickProcess}                                     | :name    | Python :: Attach to running process                                         |          |        |                |                                                                           |          |                               |       |        |

